emacs/config.el
(setq workspace-dir "~/workspace/")
(setq emacs-dir (concat workspace-dir "emacs/"))
(setq projects-dir "~/dev/")
(setq org-dir "~/org/")
(setq gtd-dir (concat org-dir "/roam/gtd/"))

(load-file (expand-file-name "secrets.el" emacs-dir))

(setq user-full-name "Egor Lukin"
      user-mail-address "mail@egorlukin.me")

(setq multi-term-program-switches "--login")

(require 'epa-file)
(epa-file-enable)
(setq epa-file-encrypt-to "mail@egorlukin.me")
(setq epg-pinentry-mode 'loopback)

(setq yas-snippet-dirs '("~/org/snippets"
                         "~/emacs.d/mysnippets"))

(setq doom-theme 'doom-monokai-pro)

(setq doom-font (font-spec :family "monospace" :size 25 :weight 'semi-light)
      doom-variable-pitch-font (font-spec :family "sans" :size 25))

(setq display-line-numbers-type t)

(defun gtd/all-files ()
  (mapcar
   (lambda (f) (concat gtd/dir f))
   (append
    (mapcar
     (lambda (f) (concat "archived/" f))
     (seq-filter
      (lambda (f) (not(member f '("." ".."))))
      (directory-files (concat gtd/dir "archived"))))
    gtd/files)))

(after! org
  (setq org-directory org-dir)
  (setq org-log-done t)
  (setq org-log-into-drawer t)
  (setq org-download-dir (concat org-dir "screenshots/"))
  (setq org-archive-location (concat gtd-dir "archieved.org::"))

  (setq org-refile-targets
      '(((concat gtd-dir "gtd.org") :maxlevel . 2)
        ((concat gtd-dir "birthday.org") :maxlevel . 2)
        ((concat gtd-dir "backlog.org") :maxlevel . 2)))

  (setq org-todo-keywords
        '((sequence "TODO" "IN-PROGRESS" "WAIT" "|" "DONE" "CLOSED")))
  (setq org-agenda-files '((concat "gtd.org") (concat "birthday.org"))))

(require 'org-habit)

(setq org-habit-show-habits-only-for-today t)
(setq org-habit-preceding-days 25)
(setq org-habit-following-days 3)

(use-package org-ai
  :ensure t
  :commands (org-ai-mode
             org-ai-global-mode)
  :init
  (add-hook 'org-mode-hook #'org-ai-mode) ; enable org-ai in org-mode
  (org-ai-global-mode) ; installs global keybindings on C-c M-a
  :config
  (setq org-ai-default-chat-model "gpt-4o") ; if you are on the gpt-4 beta:
  (org-ai-install-yasnippets)) ; if you are using yasnippet and want `ai` snippets

(setq org-ai-openai-api-token open-ai-api-token)

(setq org-ai-image-model "dall-e-3")
(setq org-ai-image-default-size "1792x1024")
(setq org-ai-image-default-count 2)
(setq org-ai-image-default-style 'vivid)
(setq org-ai-image-default-quality 'hd)
(setq org-ai-image-directory (expand-file-name "ai-images/" org-directory))
