emacs/doom.org
** Org-Roam
#+begin_src elisp :tangle config.el
(defun my/org-roam-node-find-by-directory ()
  (interactive)
  (let* ((directories '("tasks" "literate" "conceptual" "projects" "planning"))
        (directory (completing-read "Enter directory: " directories)))
    (org-roam-node-find t nil
                        (lambda (node)
                          (let ((tags (org-roam-node-tags node)))
                            (member directory tags))))))

(after! org-roam
  (setq org-roam-directory "~/org/roam")
  (setq org-roam-db-location  "~/org/roam/org-roam.db")

  (setq org-roam-dailies-capture-templates
        '(("d" "default" entry
           "* %?"
           :target (file+head "%<%Y-%m-%d>.org.gpg"
                              "#+title: %<%A, %d %B %Y>\n"))))

  (setq org-roam-capture-templates
        '(("t" "Task note" plain
           "%?"
           :if-new (file+head "tasks/%<%Y%m%d%H%M%S>-${slug}.org.gpg" "#+title: ${title}\n#+filetags: :tasks\n")
           :unnarrowed t)
          ("l" "Literate note" plain
           "%?"
           :if-new (file+head "literate/%<%Y%m%d%H%M%S>-${slug}.org.gpg" "#+title: ${title}\n#+filetags: :literate\n")
           :unnarrowed t)
          ("c" "Conceptual note" plain "%?"
           :if-new (file+head "conceptual/%<%Y%m%d%H%M%S>-${slug}.org.gpg" "#+title: ${title}\n#+filetags: :conceptual\n")
           :unnarrowed t)
          ("r" "Planning note" plain "%?"
           :if-new (file+head "planning/%<%Y%m%d%H%M%S>-${slug}.org.gpg" "#+title: ${title}\n#+filetags: :planning\n")
           :unnarrowed t)
          ("p" "Project note" plain
           "%?"
           :if-new (file+head "project/%<%Y%m%d%H%M%S>-${slug}.org.gpg" "#+title: ${title}\n#+filetags: :projects\n")
           :unnarrowed t)))

  (map! :leader
        :prefix "r"
        :desc "org-roam-node-insert" "i" #'org-roam-node-insert
        :desc "org-roam-node-find" "f" #'org-roam-node-find
        :desc "org-roam-node-find-by-directory" "t" #'my/org-roam-node-find-by-directory
        :desc "org-roam-dailies-goto-date" "s" #'org-roam-dailies-goto-date
        :desc "org-roam-dailies-goto-today" "d" #'org-roam-dailies-goto-today
        :desc "org-roam-buffer" "l" #'org-roam-buffer
        :desc "org-roam-show-graph" "g" #'org-roam-show-graph
        :desc "org-roam-dailies-find-next-note" "n" #'org-roam-dailies-find-next-note
        :desc "org-roam-dailies-find-previous-note" "p" #'org-roam-dailies-find-previous-note
        :desc "org-roam-buffer-toggle" "b" #'org-roam-buffer-toggle
        :desc "org-roam-capture" "c" #'org-roam-capture))
#+end_src
** Org-Capture
#+begin_src elisp :tangle config.el
(defun my/daily-note-filename ()
  (let ((date (format-time-string "%Y-%m-%d" (current-time))))
    (concat
     "~/org/roam/daily/"
     date
     ".org.gpg")))

;; %Y-%m-%d.org
(after! org
  (setq org-capture-templates
        '(("t" "Todo" entry
           (file+headline "roam/gtd/gtd.org" "Inbox")
           (file "templates/todo.org"))
          ("e" "English word" entry
           (file+headline "anki/english_words.org" "Backlog")
           (file "templates/english_words.org"))
          ("b" "Add entry to daily buffer" entry
           (file+headline (lambda () (my/daily-note-filename)) "buffer")
           (file "templates/buffer.org")))))
#+end_src
** Org-Clock
#+begin_src elisp :tangle config.el
(setq org-clock-persist 'history)
(org-clock-persistence-insinuate)
(setq org-clock-persist t)
#+end_src
** Ellama
https://github.com/s-kostyaev/ellama
#+begin_src elisp :tangle config.el
(use-package ellama
  :init
  ;; setup key bindings
  (setopt ellama-keymap-prefix "C-c e")
  ;; language you want ellama to translate to
  (setopt ellama-language "Russian")
  ;; could be llm-openai for example
  (require 'llm-ollama)

  (setopt ellama-sessions-directory "~/org/ellama")

  (setopt ellama-provider
		    (make-llm-ollama
		     ;; this model should be pulled to use it
		     ;; value should be the same as you print in terminal during pull
		     :chat-model "llama3:latest"
		     :embedding-model "llama3:latest"))
  ;; Predefined llm providers for interactive switching.
  ;; You shouldn't add ollama providers here - it can be selected interactively
  ;; without it. It is just example.
  ;; (setopt ellama-providers
  ;;       	    '(("llama3" . (make-llm-ollama
  ;;       			   :chat-model "zephyr:7b-beta-q6_K"
  ;;       			   :embedding-model "zephyr:7b-beta-q6_K"))
  ;;       	      ("mistral" . (make-llm-ollama
  ;;       			    :chat-model "mistral:7b-instruct-v0.2-q6_K"
  ;;       			    :embedding-model "mistral:7b-instruct-v0.2-q6_K"))
  ;;       	      ("mixtral" . (make-llm-ollama
  ;;       			    :chat-model "mixtral:8x7b-instruct-v0.1-q3_K_M-4k"
  ;;       			    :embedding-model "mixtral:8x7b-instruct-v0.1-q3_K_M-4k"))))
  ;; Naming new sessions with llm
  (setopt ellama-naming-provider
	    (make-llm-ollama
	     :chat-model "llama3:latest"
	     :embedding-model "llama3:latest"))
  (setopt ellama-naming-scheme 'ellama-generate-name-by-llm)
  ;; Translation llm provider
  (setopt ellama-translation-provider (make-llm-ollama
					 :chat-model "llama3:latest"
					 :embedding-model "llama3:latest")))
#+end_src
** Projectile
#+begin_src elisp :tangle config.el
(setq projectile-project-search-path '("~/dev"))
#+end_src
** Search
fuzzy search by default
#+begin_src elisp :tangle config.el
(setq helm-mode-fuzzy-match t)

(setq ivy-re-builders-alist
      '((counsel-ag . regexp-quote)
        (t      . ivy--regex-fuzzy)))
#+end_src
** Ein
#+begin_src elisp :tangle config.el
(setq ein:output-area-inlined-images t)

(map! :leader
      :prefix "j"
      :desc "execute cell" "e" #'ein:worksheet-execute-cell
      :desc "save notebook" "s" #'ein:notebook-save-notebook-command
      :desc "insert below" "b" #'ein:worksheet-insert-cell-below
      :desc "insert below" "a" #'ein:worksheet-insert-cell-after
      :desc "notebook list" "l" #'ein:notebooklist-open)
#+end_src
** Google Translate
#+begin_src elisp :tangle config.el
;; Google Translate Integration
(global-set-key "\C-ct" 'google-translate-at-point)
(global-set-key "\C-cr" 'google-translate-at-point-reverse)
(global-set-key "\C-cT" 'google-translate-query-translate)

(setq google-translate-default-source-language '"en")
(setq google-translate-default-target-language '"ru")

(setq google-translate-backend-method 'curl)
#+end_src

Fix problem with searching https://github.com/atykhonov/google-translate/issues/52
#+begin_src elisp :tangle config.el
(use-package google-translate
  ;; :ensure t
  :custom
  (google-translate-backend-method 'curl)
  :config
   (defun google-translate--search-tkk () "Search TKK." (list 430675 2721866130)))
#+end_src
** EWW
#+begin_src elisp :tangle config.el
(setq browse-url-browser-function 'eww-browse-url)
(setq eww-download-directory "~/cached-web-pages")

;; Auto-rename new eww buffers
(defun xah-rename-eww-hook ()
  "Rename eww browser's buffer so sites open in new page."
  (rename-buffer "eww" t))
(add-hook 'eww-mode-hook #'xah-rename-eww-hook)
;; C-u M-x eww will force a new eww buffer
(defun modi/force-new-eww-buffer (orig-fun &rest args)
  "When prefix argument is used, a new eww buffer will be created,
regardless of whether the current buffer is in `eww-mode'."
  (if current-prefix-arg
      (with-temp-buffer
        (apply orig-fun args))
    (apply orig-fun args)))
(advice-add 'eww :around #'modi/force-new-eww-buffer)

(after! eww
  (map! :leader
        :prefix "e"
        :desc "eww-list-buffers" "l" #'eww-list-buffers
        :desc "eww-copy-page-url" "y" #'eww-copy-page-url))
#+end_src
** Elfeed RSS
#+begin_src elisp :tangle config.el
(after! elfeed
  (setq elfeed-search-filter "@1-month-ago +unread")
  (setq elfeed-db-directory "~/elfeed.db"))
#+end_src
** Deft
#+begin_src elisp :tangle config.el
(setq deft-directory "~/org")
(setq deft-extensions '("txt" "tex" "org"))
(setq deft-recursive t)
#+end_src

#+begin_src elisp
(map! :leader
      (:prefix-map ("d" . "deft")
       :desc "deft-find-file" "f" #'deft-find-file))
#+end_src
